samples/expression_tree_dot/not_and_or.dot
digraph expression {
  rankdir=TB;
  "node1" [label = "OR", fillcolor = "lightcoral", style = "filled", name = "node1"];
  "node2" [label = "NOT", fillcolor = "yellow", style = "filled", name = "node2"];
  "node3" [label = "AND", fillcolor = "lightgreen", style = "filled", name = "node3"];
  "node4" [label = "x", fillcolor = "lightblue", style = "filled", name = "node4"];
  "node5" [label = "y", fillcolor = "lightblue", style = "filled", name = "node5"];
  "node6" [label = "NOT", fillcolor = "yellow", style = "filled", name = "node6"];
  "node7" [label = "z", fillcolor = "lightblue", style = "filled", name = "node7"];
  "node1" -> "node2" [label = "L"];
  "node1" -> "node3" [label = "R"];
  "node2" -> "node4";
  "node3" -> "node5" [label = "L"];
  "node3" -> "node6" [label = "R"];
  "node6" -> "node7";
}
